espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/driverlib/chipinfo.h
   return( minorRev );
}

//*****************************************************************************
//
//! \brief Returns the 32 bits USER_ID field
//!
//! How to decode the USER_ID filed is described in the Technical Reference Manual (TRM)
//!
//! \return
//! Returns the 32 bits USER_ID field
//
//*****************************************************************************
__STATIC_INLINE uint32_t
ChipInfo_GetUserId( void )
{
   return ( HWREG( FCFG1_BASE + FCFG1_O_USER_ID ));
}

//*****************************************************************************
//
//! \brief Chip type enumeration
//
//*****************************************************************************
typedef enum {
   CHIP_TYPE_Unknown       = -1,    //!< -1 means that the chip type is unknown.
   CHIP_TYPE_CC1310        =  0,    //!<  0 means that this is a CC1310 chip.
   CHIP_TYPE_CC1350        =  1,    //!<  1 means that this is a CC1350 chip.
   CHIP_TYPE_CC2620        =  2,    //!<  2 means that this is a CC2620 chip.
   CHIP_TYPE_CC2630        =  3,    //!<  3 means that this is a CC2630 chip.
   CHIP_TYPE_CC2640        =  4,    //!<  4 means that this is a CC2640 chip.
   CHIP_TYPE_CC2650        =  5,    //!<  5 means that this is a CC2650 chip.
   CHIP_TYPE_CUSTOM_0      =  6,    //!<  6 means that this is a CUSTOM_0 chip.
   CHIP_TYPE_CUSTOM_1      =  7,    //!<  7 means that this is a CUSTOM_1 chip.
   CHIP_TYPE_CC2640R2      =  8,    //!<  8 means that this is a CC2640R2 chip.
   CHIP_TYPE_CC2642        =  9,    //!<  9 means that this is a CC2642 chip.
   CHIP_TYPE_unused        =  10,   //!< 10 unused value
   CHIP_TYPE_CC2652        =  11,   //!< 11 means that this is a CC2652 chip.
   CHIP_TYPE_CC1312        =  12,   //!< 12 means that this is a CC1312 chip.
   CHIP_TYPE_CC1352        =  13,   //!< 13 means that this is a CC1352 chip.
   CHIP_TYPE_CC1352P       =  14,   //!< 14 means that this is a CC1352P chip.
   CHIP_TYPE_CC2652P       =  15,   //!< 15 means that this is a CC2652P chip.
   CHIP_TYPE_CC2652RB      =  16,   //!< 16 means that this is a CC2652RB chip.
   CHIP_TYPE_CC2652PB      =  17,   //!< 17 means that this is a CC2652PB chip.
   CHIP_TYPE_CC1311R3      =  18,   //!< 18 means that this is a CC1311R3 chip.
   CHIP_TYPE_CC1311P3      =  19,   //!< 19 means that this is a CC1311P3 chip.
   CHIP_TYPE_CC2651R3      =  20,   //!< 20 means that this is a CC2651R3 chip.
   CHIP_TYPE_CC2651P3      =  21,   //!< 21 means that this is a CC2651P3 chip.
   CHIP_TYPE_CC2641R3      =  22,   //!< 22 means that this is a CC2641R3 chip.
   CHIP_TYPE_CC1312R7      =  23,   //!< 23 means that this is a CC1312R7 chip.
   CHIP_TYPE_unused1       =  24,   //!< 24 unused value
   CHIP_TYPE_CC1352R7      =  25,   //!< 25 means that this is a CC1352R7 chip.
   CHIP_TYPE_CC1352P7      =  26,   //!< 26 means that this is a CC1352P7 chip.
   CHIP_TYPE_CC2652R7      =  27,   //!< 27 means that this is a CC2652R7 chip.
   CHIP_TYPE_CC2652P7      =  28,   //!< 28 means that this is a CC2652P7 chip.
   // Note: The following chip types are drafts only and for internal use at moment.
   CHIP_TYPE_CC2652R5      =  29,   //!< 29 means that this is a CC2652R5 chip.
   CHIP_TYPE_CC1314R10     =  30,   //!< 30 means that this is a CC1314R10 chip.
   CHIP_TYPE_CC1354P10     =  31,   //!< 31 means that this is a CC1354P10 chip.
   CHIP_TYPE_CC1354R10     =  32,   //!< 32 means that this is a CC1354R10 chip.
   CHIP_TYPE_CC2654P10     =  33,   //!< 33 means that this is a CC2654P10 chip.
   CHIP_TYPE_CC2654R10     =  34,   //!< 34 means that this is a CC2654R10 chip.
   CHIP_TYPE_CC2674P10     =  35,   //!< 35 means that this is a CC2674P10 chip.
   CHIP_TYPE_CC2674R10     =  36,   //!< 36 means that this is a CC2674R10 chip.
   CHIP_TYPE_CC2672R3      =  37,   //!< 37 means that this is a CC2672R3 chip.
   CHIP_TYPE_CC2672P3      =  38,   //!< 38 means that this is a CC2672P3 chip.
} ChipType_t;

//*****************************************************************************
//
//! \brief Returns chip type.
//!
//! \return
//! Returns \ref ChipType_t
//
//*****************************************************************************
extern ChipType_t ChipInfo_GetChipType( void );

//*****************************************************************************
//
//! \brief Chip family enumeration
//
//*****************************************************************************
typedef enum {
   FAMILY_Unknown           = -1, //!< -1 means that the chip's family member is unknown.
   FAMILY_CC26x0            =  0, //!<  0 means that the chip is a CC26x0 family member.
   FAMILY_CC13x0            =  1, //!<  1 means that the chip is a CC13x0 family member.
   FAMILY_CC13x1_CC26x1     =  2, //!<  2 means that the chip is a CC13x1, CC26x1 family member.
   FAMILY_CC26x0R2          =  3, //!<  3 means that the chip is a CC26x0R2 family (new ROM contents).
   FAMILY_CC13x2_CC26x2     =  4, //!<  4 means that the chip is a CC13x2, CC26x2 family member.
   FAMILY_CC13x2x7_CC26x2x7 =  5, //!<  5 means that the chip is a CC13x2x7, CC26x2x7 family member.
   FAMILY_CC13x4_CC26x4     =  6, //!<  6 means that the chip is a CC13x4, CC26x4 family member.
   FAMILY_CC23x0            =  7, //!<  7 means that the chip is a CC23x0 family member.
} ChipFamily_t;

//*****************************************************************************
//
//! \brief Returns chip family member.
//!
//! \return
//! Returns \ref ChipFamily_t
//
//*****************************************************************************
extern ChipFamily_t ChipInfo_GetChipFamily( void );

//*****************************************************************************
//
// Options for the define THIS_DRIVERLIB_BUILD
//
//*****************************************************************************
#define DRIVERLIB_BUILD_CC26X0            0 //!< 0 is the driverlib build ID for the cc26x0 driverlib.
#define DRIVERLIB_BUILD_CC13X0            1 //!< 1 is the driverlib build ID for the cc13x0 driverlib.
#define DRIVERLIB_BUILD_CC13X1_CC26X1     2 //!< 2 is the driverlib build ID for the cc13x1_cc26x1 driverlib.
#define DRIVERLIB_BUILD_CC26X0R2          3 //!< 3 is the driverlib build ID for the cc26x0r2 driverlib.
#define DRIVERLIB_BUILD_CC13X2_CC26X2     4 //!< 4 is the driverlib build ID for the cc13x2_cc26x2 driverlib.
#define DRIVERLIB_BUILD_CC13X2X7_CC26X2X7 5 //!< 5 is the driverlib build ID for the cc13x2x7_cc26x2x7 driverlib.
#define DRIVERLIB_BUILD_CC13X4_CC26X4     6 //!< 6 is the driverlib build ID for the cc13x4_cc26x4 driverlib.
#define DRIVERLIB_BUILD_CC23X0            7 //!< 7 is the driverlib build ID for the cc23x0 driverlib.

//*****************************************************************************
//
//! \brief Define THIS_DRIVERLIB_BUILD, identifying current driverlib build ID.
//!
//! This driverlib build identifier can be useful for compile time checking/optimization (supporting C preprocessor expressions).
//
//*****************************************************************************
#define THIS_DRIVERLIB_BUILD   DRIVERLIB_BUILD_CC13X4_CC26X4

//*****************************************************************************
//
//! \brief Returns true if this chip is member of the CC13x0 family.
//!
//! \return
//! Returns \c true if this chip is member of the CC13x0 family, \c false otherwise.
//
//*****************************************************************************
__STATIC_INLINE bool
ChipInfo_ChipFamilyIs_CC13x0( void )
{
   return ( ChipInfo_GetChipFamily() == FAMILY_CC13x0 );
}

//*****************************************************************************
//
//! \brief Returns true if this chip is member of the CC26x0 family.
//!
//! \return
//! Returns \c true if this chip is member of the CC26x0 family, \c false otherwise.
//
//*****************************************************************************
__STATIC_INLINE bool
ChipInfo_ChipFamilyIs_CC26x0( void )
{
   return ( ChipInfo_GetChipFamily() == FAMILY_CC26x0 );
}

//*****************************************************************************
//
//! \brief Returns true if this chip is member of the CC26x0R2 family.
//!
//! \return
//! Returns \c true if this chip is member of the CC26x0R2 family, \c false otherwise.
//
//*****************************************************************************
__STATIC_INLINE bool
ChipInfo_ChipFamilyIs_CC26x0R2( void )
{
   return ( ChipInfo_GetChipFamily() == FAMILY_CC26x0R2 );
}

//*****************************************************************************
//
//! \brief Returns true if this chip is member of the CC13x1, CC26x1 family.
//!
//! \return
//! Returns \c true if this chip is member of the CC13x1, CC26x1 family, \c false otherwise.
//
//*****************************************************************************
__STATIC_INLINE bool
ChipInfo_ChipFamilyIs_CC13x1_CC26x1( void )
{
   return ( ChipInfo_GetChipFamily() == FAMILY_CC13x1_CC26x1 );
}

//*****************************************************************************
//
//! \brief Returns true if this chip is member of the CC13x2, CC26x2 family.
//!
//! \return
//! Returns \c true if this chip is member of the CC13x2, CC26x2 family, \c false otherwise.
//
//*****************************************************************************
__STATIC_INLINE bool
ChipInfo_ChipFamilyIs_CC13x2_CC26x2( void )
{
   return ( ChipInfo_GetChipFamily() == FAMILY_CC13x2_CC26x2 );
}

//*****************************************************************************
//
//! \brief Returns true if this chip is member of the CC13x2x7, CC26x2x7 family.
//!
//! \return
//! Returns \c true if this chip is member of the CC13x2x7, CC26x2x7 family, \c false otherwise.
//
//*****************************************************************************
__STATIC_INLINE bool
ChipInfo_ChipFamilyIs_CC13x2x7_CC26x2x7( void )
{
   return ( ChipInfo_GetChipFamily() == FAMILY_CC13x2x7_CC26x2x7 );
}

//*****************************************************************************
//
//! \brief HW revision enumeration.
//
//*****************************************************************************
typedef enum {
   HWREV_Unknown     = -1, //!< -1 means that the chip's HW revision is unknown.
   HWREV_1_0         = 10, //!< 10 means that the chip's HW revision is 1.0
   HWREV_1_1         = 11, //!< 11 means that the chip's HW revision is 1.1
   HWREV_2_0         = 20, //!< 20 means that the chip's HW revision is 2.0
   HWREV_2_1         = 21, //!< 21 means that the chip's HW revision is 2.1
   HWREV_2_2         = 22, //!< 22 means that the chip's HW revision is 2.2
   HWREV_2_3         = 23, //!< 23 means that the chip's HW revision is 2.3
   HWREV_2_4         = 24, //!< 24 means that the chip's HW revision is 2.4
   HWREV_3_0         = 30  //!< 30 means that the chip's HW revision is 3.0
} HwRevision_t;

//*****************************************************************************
//
//! \brief Returns chip HW revision.
//!
//! \return
//! Returns \ref HwRevision_t
//
//*****************************************************************************
extern HwRevision_t ChipInfo_GetHwRevision( void );

//*****************************************************************************
//
//! \brief Returns true if HW revision for this chip is 1.0.
//!
//! \return
//! Returns \c true if HW revision for this chip is 1.0, \c false otherwise.
//
//*****************************************************************************
__STATIC_INLINE bool
ChipInfo_HwRevisionIs_1_0( void )
{
   return ( ChipInfo_GetHwRevision() == HWREV_1_0 );
}

//*****************************************************************************
//
//! \brief Returns true if HW revision for this chip is 2.0.
//!
//! \return
//! Returns \c true if HW revision for this chip is 2.0, \c false otherwise.
//
//*****************************************************************************
__STATIC_INLINE bool
ChipInfo_HwRevisionIs_2_0( void )
{
   return ( ChipInfo_GetHwRevision() == HWREV_2_0 );
}

//*****************************************************************************
//
//! \brief Returns true if HW revision for this chip is 2.0 or greater.
//!
//! \return
//! Returns \c true if HW revision for this chip is 2.0 or greater, \c false otherwise.
//
//*****************************************************************************
__STATIC_INLINE bool
ChipInfo_HwRevisionIs_GTEQ_2_0( void )
{
   return ( ChipInfo_GetHwRevision() >= HWREV_2_0 );
}

//*****************************************************************************
//
//! \brief Returns true if HW revision for this chip is 2.1.
//!
//! \return
//! Returns \c true if HW revision for this chip is 2.1, \c false otherwise.
//
//*****************************************************************************
__STATIC_INLINE bool
ChipInfo_HwRevisionIs_2_1( void )
{
   return ( ChipInfo_GetHwRevision() == HWREV_2_1 );
}

//*****************************************************************************
//
//! \brief Returns true if HW revision for this chip is 2.1 or greater.
//!
//! \return
//! Returns \c true if HW revision for this chip is 2.1 or greater, \c false otherwise.
//
//*****************************************************************************
__STATIC_INLINE bool
ChipInfo_HwRevisionIs_GTEQ_2_1( void )
{
   return ( ChipInfo_GetHwRevision() >= HWREV_2_1 );
}

//*****************************************************************************
//
//! \brief Returns true if HW revision for this chip is 2.2.
//!
//! \return
//! Returns \c true if HW revision for this chip is 2.2, \c false otherwise.
//
//*****************************************************************************
__STATIC_INLINE bool
ChipInfo_HwRevisionIs_2_2( void )
{
   return ( ChipInfo_GetHwRevision() == HWREV_2_2 );
}

//*****************************************************************************
//
//! \brief Returns true if HW revision for this chip is 2.2 or greater.
//!
//! \return
//! Returns \c true if HW revision for this chip is 2.2 or greater, \c false otherwise.
//
//*****************************************************************************
__STATIC_INLINE bool
ChipInfo_HwRevisionIs_GTEQ_2_2( void )
{
   return ( ChipInfo_GetHwRevision() >= HWREV_2_2 );
}

//*****************************************************************************
//
//! \brief Returns true if HW revision for this chip is 2.3 or greater.
//!
//! \return
//! Returns \c true if HW revision for this chip is 2.3 or greater, \c false otherwise.
//
//*****************************************************************************
__STATIC_INLINE bool
ChipInfo_HwRevisionIs_GTEQ_2_3( void )
{
   return ( ChipInfo_GetHwRevision() >= HWREV_2_3 );
}

//*****************************************************************************
//
//! \brief Returns true if HW revision for this chip is 2.4 or greater.
//!
//! \return
//! Returns \c true if HW revision for this chip is 2.4 or greater, \c false otherwise.
//
//*****************************************************************************
__STATIC_INLINE bool
ChipInfo_HwRevisionIs_GTEQ_2_4( void )
{
   return ( ChipInfo_GetHwRevision() >= HWREV_2_4 );
}

//*****************************************************************************
//
//! \brief Verifies that current chip is CC13x4 or CC26x4 and never returns if violated.
//!
//! \return None
//
//*****************************************************************************
extern void ThisLibraryIsFor_CC13x4_CC26x4_HaltIfViolated( void );

//*****************************************************************************
//
// Support for DriverLib in ROM:
// Redirect to implementation in ROM when available.
//
//*****************************************************************************
#if !defined(DRIVERLIB_NOROM) && !defined(DOXYGEN)
    #include "../driverlib/rom.h"
    #ifdef ROM_ChipInfo_GetSupportedProtocol_BV
        #undef  ChipInfo_GetSupportedProtocol_BV
        #define ChipInfo_GetSupportedProtocol_BV ROM_ChipInfo_GetSupportedProtocol_BV
    #endif
    #ifdef ROM_ChipInfo_GetPackageType
        #undef  ChipInfo_GetPackageType
        #define ChipInfo_GetPackageType         ROM_ChipInfo_GetPackageType
    #endif
    #ifdef ROM_ChipInfo_GetChipType
        #undef  ChipInfo_GetChipType
        #define ChipInfo_GetChipType            ROM_ChipInfo_GetChipType
    #endif
    #ifdef ROM_ChipInfo_GetChipFamily
        #undef  ChipInfo_GetChipFamily
        #define ChipInfo_GetChipFamily          ROM_ChipInfo_GetChipFamily
    #endif
    #ifdef ROM_ChipInfo_GetHwRevision
        #undef  ChipInfo_GetHwRevision
        #define ChipInfo_GetHwRevision          ROM_ChipInfo_GetHwRevision
    #endif
    #ifdef ROM_ThisLibraryIsFor_CC13x4_CC26x4_HaltIfViolated
        #undef  ThisLibraryIsFor_CC13x4_CC26x4_HaltIfViolated
        #define ThisLibraryIsFor_CC13x4_CC26x4_HaltIfViolated ROM_ThisLibraryIsFor_CC13x4_CC26x4_HaltIfViolated
    #endif
#endif

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif // __CHIP_INFO_H__

//*****************************************************************************
//
//! Close the Doxygen group.
//! @}
//! @}
//
//*****************************************************************************
